Duet3D/Duet3Expansion/src/atmel/SAMC20_DFP/1.1.95/samc20n/include/component/supc.h
#define SUPC_VREG33_ENABLE_Pos      1            /**< \brief (SUPC_VREG33) VREG33 Enable */
#define SUPC_VREG33_ENABLE          (_U_(0x1) << SUPC_VREG33_ENABLE_Pos)
#define SUPC_VREG33_ENRDY_Pos       2            /**< \brief (SUPC_VREG33) VREG33 Ready Enable */
#define SUPC_VREG33_ENRDY           (_U_(0x1) << SUPC_VREG33_ENRDY_Pos)
#define SUPC_VREG33_BYPASS_Pos      3            /**< \brief (SUPC_VREG33) VREG33 Bypass */
#define SUPC_VREG33_BYPASS          (_U_(0x1) << SUPC_VREG33_BYPASS_Pos)
#define SUPC_VREG33_ISOEN_Pos       4            /**< \brief (SUPC_VREG33) Isolation Enable */
#define SUPC_VREG33_ISOEN           (_U_(0x1) << SUPC_VREG33_ISOEN_Pos)
#define SUPC_VREG33_MASK            _U_(0x0000001E) /**< \brief (SUPC_VREG33) MASK Register */

/** \brief SUPC hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct {
  __IO SUPC_INTENCLR_Type        INTENCLR;    /**< \brief Offset: 0x00 (R/W 32) Interrupt Enable Clear */
  __IO SUPC_INTENSET_Type        INTENSET;    /**< \brief Offset: 0x04 (R/W 32) Interrupt Enable Set */
  __IO SUPC_INTFLAG_Type         INTFLAG;     /**< \brief Offset: 0x08 (R/W 32) Interrupt Flag Status and Clear */
  __I  SUPC_STATUS_Type          STATUS;      /**< \brief Offset: 0x0C (R/  32) Power and Clocks Status */
  __IO SUPC_BODVDD_Type          BODVDD;      /**< \brief Offset: 0x10 (R/W 32) BODVDD Control */
  __IO SUPC_BODCORE_Type         BODCORE;     /**< \brief Offset: 0x14 (R/W 32) BODCORE Control */
  __IO SUPC_VREG_Type            VREG;        /**< \brief Offset: 0x18 (R/W 32) VREG Control */
  __IO SUPC_VREF_Type            VREF;        /**< \brief Offset: 0x1C (R/W 32) VREF Control */
  __IO SUPC_VREG33_Type          VREG33;      /**< \brief Offset: 0x20 (R/W 32) VREG33 Control */
} Supc;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/*@}*/

#endif /* _SAMC20_SUPC_COMPONENT_ */
